function Faq() {
  const faq = [
    {
      q: "Какво е Quizer's?",
      a: "Quizer's е безплатно уеб приложение за тестове, задачи и помощни материали за ученици. Приложението предлага и възможност да запазите час за урок или консултация."
    },
    {
      q: "Нужна ли ми е регистрация?",
      a: "За момента регистрация не е нужна."
    },
    {
      q: "Къде се пазят отговорите ми?",
      a: "Отговорите от тестовете се пазят в local storage на браузера ви."
    },
    {
      q: "Какви уроци/консултации се предлагат?",
      a: "За момента се предлагат уроци/консултации по математика, физика, програмиране и уеб технологии."
    },
    {
      q: "Присъствен или онлайн урок/консултация?",
      a: "Уроците/консултациите се провеждат присъствено или онлайн, в зависимост от желанието и възможностите на клиента и преподавателя."
    },
    {
      q: "Къде се провеждат присъствените уроци/консултации?",
      a: "Присъствените уроци/консултации се провеждат в град София, квартал Люлин-7."
    },
    {
      q: "Как да си запазя час за урок/консултация?",
      a: "Можете да запазите час за урок/консултация през календара в края на всака страница. До края на работния ден наш служител ще се свърже с вас."
    },
    {
      q: "Кой стой зад проекта?",
      a: "Quizer's е личен проект на Атанас Папучаров - математик, физик, програмист, музикант и учител."
    }
  ]

  return ( 
    <div>
      <h2 className='center'>ЧЕСТО ЗАДАВАНИ ВЪПРОСИ</h2>
      {
        faq.map((obj: any, i: number) => {
          return <div key={i}>
            <hr />
            <article>
              <h3><strong>{obj.q}</strong></h3>
              <p><em>{obj.a}</em></p>
            </article>
          </div>
        })
      }
    </div> 
  )
}

export default Faq